app/controllers/articles_controller.rb

SELECT  "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
	def show
		@article = Article.find(params[:id])

INSERT INTO "articles" ("title", "text", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "set"], ["text", "asdf"], ["created_at", "2017-08-24 22:16:40.229526"], ["updated_at", "2017-08-24 22:16:40.229526"]]
---
	def create
	  @article = Article.new(article_params)
	  @article.save

SELECT "articles".* FROM "articles"
---
	def index
		@articles = Article.all